Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Capped results show a Fetch All button to load the full set
fr: Les résultats limités montrent un bouton "Retirer tout" pour charger l'ensemble complet.
ko: 제한된 결과에는 전체 데이터를 불러오는 '모두 가져오기' 버튼이 표시됩니다
tr: Sınırlanmış sonuçlar, tüm seti yüklemek için Tümünü Getir düğmesi gösterir
vi: Kết quả bị giới hạn sẽ hiển thị nút Tải tất cả để lấy toàn bộ dữ liệu
zh_hans: 受限结果会显示"获取全部"按钮以加载完整数据集
zh_hant: 受限結果會顯示「擷取全部」按鈕以載入完整資料集

source: Choose a shared folder for your team's connection catalog. Teammates add this folder under Settings > %1$@ > %2$@ to see published connections.
fr: Choisissez un dossier partagé pour le catalogue de connexions de votre équipe. Les membres de l'équipe ajoutent ce dossier sous Paramètres > %1$@ > %2$@ pour voir les connexions publiées.
ko: 팀의 연결 카탈로그를 위한 공유 폴더를 선택하십시오. 팀원은 설정 > %1$@ > %2$@에서 이 폴더를 추가하여 게시된 연결을 볼 수 있습니다.
tr: Takımınızın bağlantı kataloğu için paylaşılan bir klasör seçin. Takım arkadaşlarınız yayınlanan bağlantıları görmek için bu klasörü Ayarlar > %1$@ > %2$@ altına ekler.
vi: Chọn một thư mục dùng chung cho danh mục kết nối của nhóm. Đồng đội thêm thư mục này trong Cài đặt > %1$@ > %2$@ để xem các kết nối đã xuất bản.
zh_hans: 为团队的连接目录选择一个共享文件夹。队友在“设置 > %1$@ > %2$@”中添加此文件夹即可看到已发布的连接。
zh_hant: 為團隊的連線目錄選擇一個共用資料夾。隊友在「設定 > %1$@ > %2$@」中加入此資料夾即可看到已發佈的連線。

source: Option key to pass in 'options'
fr: Clé d'option à passer dans 'options'
ko: 'options'에 전달할 옵션 키
tr: 'options' içinde geçirilecek seçenek anahtarı
vi: Khoá tuỳ chọn để truyền trong 'options'
zh_hans: 要在 'options' 中传入的选项键
zh_hant: 要在 'options' 中傳入的選項鍵

source: Grant privileges to %@
fr: Accorder des privilèges à %@
ko: %@에 권한 부여
tr: %@ hesabına yetki ver
vi: Cấp quyền cho %@
zh_hans: 向 %@ 授予权限
zh_hant: 向 %@ 授予權限

source: Proposed statement
fr: Déclaration proposée

source: Total size
fr: Taille totale
ko: 전체 크기
tr: Toplam boyut
vi: Tổng kích thước
zh_hans: 总大小
zh_hant: 總大小

source: Low
fr: Bas
ko: 낮음
tr: Düşük
vi: Thấp
zh_hans: 低
zh_hant: 低

source: Save Dump
fr: Sauvegarder le déversement
ko: 덤프 저장
tr: Dökümü Kaydet
vi: Lưu dump
zh_hans: 保存转储
zh_hant: 儲存備份檔

source: SSH tunnel disconnected. Click to reconnect.
fr: Tunnel SSH déconnecté. Cliquez pour vous reconnecter.
ko: SSH 터널 연결이 끊어졌습니다. 클릭하여 다시 연결하십시오.
tr: SSH tüneli bağlantısı kesildi. Yeniden bağlanmak için tıklayın.
vi: SSH tunnel đã ngắt kết nối. Bấm để kết nối lại.
zh_hans: SSH 隧道已断开。点按以重新连接。
zh_hant: SSH 隧道已中斷連線。點按以重新連線。

source: Credentials
fr: Lettres de créance
ko: 자격 증명
tr: Kimlik Bilgileri
vi: Thông tin đăng nhập
zh_hans: 凭据
zh_hant: 認證資訊

source: Lifetime
fr: Durée
ko: 영구
tr: Ömür Boyu
vi: Trọn đời
zh_hans: 终身
zh_hant: 終身

source: Current database
fr: Base de données actuelle
ko: 현재 데이터베이스
tr: Geçerli veritabanı
vi: Cơ sở dữ liệu hiện tại
zh_hans: 当前数据库
zh_hant: 目前的資料庫

source: %1$lld statements executed, %2$lld failed
fr: %1$lld déclarations exécutées, %2$lld échouées
ko: %1$lld개 SQL 문 실행됨, %2$lld개 실패
tr: %1$lld ifade çalıştırıldı, %2$lld başarısız
vi: Đã chạy %1$lld câu lệnh, %2$lld lỗi
zh_hans: 已执行 %1$lld 条语句，%2$lld 条失败
zh_hant: 已執行 %1$lld 條陳述式，%2$lld 條失敗

source: This database cannot reference a table in another schema.
fr: Cette base de données ne peut pas faire référence à une table dans un autre schéma.

source: No Results Yet
fr: Pas encore de résultats

source: Ask every time
fr: Demandez à chaque fois

source: %@ failed
fr: %@ échoué
ko: %@ 실패
tr: %@ başarısız oldu
vi: %@ thất bại
zh_hans: %@ 失败
zh_hant: %@ 失敗

source: %1$lld users, %2$lld roles
fr: %1$lld utilisateurs, %2$lld rôles
ko: 사용자 %1$lld명, 역할 %2$lld개
tr: %1$lld kullanıcı, %2$lld rol
vi: %1$lld người dùng, %2$lld vai trò
zh_hans: %1$lld 个用户，%2$lld 个角色
zh_hant: %1$lld 個使用者、%2$lld 個角色

source: Table Description
fr: Description de la table
ko: 테이블 설명
tr: Tablo Açıklaması
vi: Mô tả bảng
zh_hans: 表说明
zh_hant: 資料表說明

source: Preparing Import…
fr: Préparation de l'importation...

source: That folder could not be read.
fr: Ce dossier n'a pas pu être lu.
ko: 해당 폴더를 읽을 수 없습니다.
tr: Bu klasör okunamadı.
vi: Không thể đọc thư mục đó.
zh_hans: 无法读取该文件夹。
zh_hant: 無法讀取該資料夾。

source: Row no longer exists
fr: La rangée n'existe plus
ko: 행이 더 이상 존재하지 않습니다
tr: Satır artık yok
vi: Dòng không còn tồn tại
zh_hans: 该行已不存在
zh_hant: 該列已不存在

source: Close Connection
fr: Fermer la connexion
ko: 연결 닫기
tr: Bağlantıyı Kapat
vi: Đóng kết nối
zh_hans: 关闭连接
zh_hant: 關閉連線

source: DuckDB database file
fr: Fichier de base de données DuckDB

source: Pre-connect script failed with exit code %d
fr: L'exécution du script de pré-connexion a échoué avec le code d'arrêt %d.
ko: 연결 전 스크립트 실패(종료 코드 %d)
tr: Bağlantı öncesi betik %d çıkış koduyla başarısız oldu
vi: Tập lệnh tiền kết nối thất bại với mã thoát %d
zh_hans: 连接前脚本失败，退出码 %d
zh_hant: 連線前指令稿失敗，退出碼 %d

source: Send one statement at a time.
fr: Envoyez une déclaration à la fois.
ko: 한 번에 명령문 하나만 보내십시오.
tr: Her seferinde tek bir ifade gönderin.
vi: Mỗi lần chỉ gửi một câu lệnh.
zh_hans: 请一次只发送一条语句。
zh_hant: 請一次只傳送一條陳述式。

source: Raw Value
fr: Valeur brute
ko: 원시 값
tr: Ham Değer
vi: Giá trị gốc
zh_hans: 原始值
zh_hant: 原始值

source: Check connections:
fr: Vérifier les connexions :

source: %1$lld of %2$lld statements were applied. This connection does not roll back user and role changes.
fr: %1$lld des déclarations %2$lld ont été appliquées. Cette connexion ne réinitialise pas les changements d'utilisateur et de rôle.
ko: %1$lld/%2$lld개 SQL 문이 적용되었습니다. 이 연결에서는 사용자 및 역할 변경을 롤백하지 않습니다.
tr: %2$lld ifadeden %1$lld tanesi uygulandı. Bu bağlantı, kullanıcı ve rol değişikliklerini geri almaz.
vi: Đã áp dụng %1$lld trên %2$lld câu lệnh. Kết nối này không hoàn tác các thay đổi người dùng và vai trò.
zh_hans: 已应用 %2$lld 条语句中的 %1$lld 条。此连接不会回滚用户和角色更改。
zh_hant: 已套用 %2$lld 條陳述式中的 %1$lld 條。此連線不會回復使用者與角色的變更。

source: Couldn't Save File
fr: Impossible d'enregistrer le fichier
ko: 파일을 저장할 수 없음
tr: Dosya Kaydedilemedi
vi: Không thể lưu tệp
zh_hans: 无法保存文件
zh_hant: 無法儲存檔案

source: File modified externally
fr: Fichier modifié de manière externe

source: Editor
fr: Éditeur
ko: 편집기
tr: Düzenleyici
vi: Trình soạn thảo
zh_hans: 编辑器
zh_hant: 編輯器

source: Dashboard
fr: Tableau de bord
ko: 대시보드
tr: Pano
vi: Bảng điều khiển
zh_hans: 仪表盘
zh_hant: 儀表板

source: Audience
fr: Public
ko: 대상
tr: Hedef Kitle
vi: Đối tượng
zh_hans: 受众
zh_hant: 對象

source: Highlight Values…
fr: Souligner les valeurs...

source: Show Favorites
fr: Afficher les favoris

source: The text is not valid JSON. Save anyway?
fr: Le texte n'est pas un JSON valide. Enregistrer quand même ?
ko: 텍스트가 유효한 JSON이 아닙니다. 그래도 저장하시겠습니까?
tr: Metin geçerli bir JSON değil. Yine de kaydedilsin mi?
vi: Nội dung không phải JSON hợp lệ. Vẫn lưu?
zh_hans: 文本不是有效的 JSON。仍然保存？
zh_hant: 文字並非有效的 JSON。仍要儲存嗎？

source: No active connection
fr: Pas de connexion active
ko: 활성 연결 없음
tr: Etkin bağlantı yok
vi: Không có kết nối đang hoạt động
zh_hans: 无活动连接
zh_hant: 無使用中的連線

source: Go to page
fr: Aller à la page
ko: 페이지로 이동
tr: Sayfaya git
vi: Đi đến trang
zh_hans: 跳转到指定页
zh_hant: 跳至指定頁

source: Secondary Preferred
fr: Préféré secondaire
ko: 보조 노드 우선

source: Import %@
fr: Importer %@

source: %@, pinned
fr: %@, épinglé
ko: %@, 고정됨
tr: %@, sabitlendi
vi: %@, đã ghim
zh_hans: %@，已固定
zh_hant: %@，已釘選

source: Missing required parameter: %@
fr: Paramètre requis manquant : %@
ko: 필수 매개변수 누락: %@
tr: Gerekli parametre eksik: %@
vi: Thiếu tham số bắt buộc: %@
zh_hans: 缺少必需参数：%@
zh_hant: 缺少必要參數：%@

source: ISO 8601 last change time
fr: Dernière modification de l'ISO 8601
ko: ISO 8601 마지막 변경 시각
tr: ISO 8601 son değişiklik zamanı
vi: Thời điểm thay đổi cuối theo ISO 8601
zh_hans: ISO 8601 最后更改时间
zh_hant: ISO 8601 最後變更時間

source: Refresh (⌘R)
fr: Recharger (⌘R)
ko: 새로 고침(⌘R)
vi: Làm mới (⌘R)
zh_hans: 刷新 (⌘R)
zh_hant: 重新整理 (⌘R)

source: Reset Sample Database…
fr: Réinitialiser la base de données d'échantillons
ko: 샘플 데이터베이스 재설정…
tr: Örnek Veritabanını Sıfırla…
vi: Đặt lại cơ sở dữ liệu mẫu…
zh_hans: 重置示例数据库…
zh_hant: 重設範例資料庫…

source: This will load all %@ rows on a single page. Large result sets use significant memory. Continue?
fr: Cela chargera toutes les lignes %@ sur une seule page. Les ensembles de résultats volumineux consomment une mémoire importante. Continuer ?
ko: %@개 행을 모두 한 페이지에 불러옵니다. 결과 집합이 크면 상당한 메모리를 사용합니다. 계속하시겠습니까?
tr: Bu işlem %@ satırın tamamını tek bir sayfada yükler. Büyük sonuç kümeleri önemli ölçüde bellek kullanır. Devam edilsin mi?
vi: Thao tác này sẽ tải toàn bộ %@ hàng trên một trang. Tập kết quả lớn dùng nhiều bộ nhớ. Tiếp tục?
zh_hans: 这将在单个页面加载全部 %@ 行。大型结果集会占用大量内存。要继续吗？
zh_hant: 這會在單一頁面載入全部 %@ 列。大型結果集會佔用大量記憶體。要繼續嗎？

source: Bytes Sent
fr: Bytes envoyés
ko: 송신 바이트
tr: Gönderilen Bayt
vi: Byte gửi
zh_hans: 发送字节
zh_hant: 傳送位元組

source: SQL or NoSQL query text
fr: Texte de requête SQL ou NoSQL
ko: SQL 또는 NoSQL 쿼리 텍스트
tr: SQL veya NoSQL sorgu metni
vi: Nội dung truy vấn SQL hoặc NoSQL
zh_hans: SQL 或 NoSQL 查询文本
zh_hant: SQL 或 NoSQL 查詢文字

# %@ of %@
source: %1$@ of %2$@
fr: %1$@ de %2$@
tr: %2$@ içinden %1$@
vi: %1$@ trên %2$@

source: Match ALL filters (AND) or ANY filter (OR)
fr: Correspondre À TOUS les filtres (ET) ou À TOUT filtre (OU)
ko: 모든 필터(AND) 또는 하나 이상의 필터(OR)와 일치
tr: TÜM filtrelerle eşleş (VE) veya HERHANGİ bir filtreyle (VEYA)
vi: Khớp TẤT CẢ bộ lọc (AND) hoặc BẤT KỲ bộ lọc (OR)
zh_hans: 匹配所有筛选条件 (AND) 或任意筛选条件 (OR)
zh_hant: 符合所有篩選條件 (AND) 或任一篩選條件 (OR)

source: Add filter row
fr: Ajouter une ligne de filtre
ko: 필터 행 추가
tr: Filtre satırı ekle
vi: Thêm dòng bộ lọc
zh_hans: 添加筛选行
zh_hant: 新增篩選列

source: Loops
fr: Boucles
ko: 반복 횟수
tr: Döngü
vi: Số vòng lặp
zh_hans: 循环次数
zh_hant: 迴圈次數

source: Could not build the CREATE TABLE statement
fr: Impossible de construire l'instruction CREATE TABLE.
ko: CREATE TABLE 문을 작성할 수 없습니다
tr: CREATE TABLE ifadesi oluşturulamadı
vi: Không thể tạo câu lệnh CREATE TABLE
zh_hans: 无法生成CREATE TABLE语句
zh_hant: 無法建立 CREATE TABLE 陳述式

source: %1$@ of about %2$@ rows
fr: %1$@ de environ %2$@ lignes

source: Joins this column with the one to its right.
fr: Joignez cette colonne à celle à sa droite.

source: No values contain the separator.
fr: Aucun des valeurs ne contient le séparateur.

source: Use SSL if available
fr: Utilisez SSL si disponible
ko: 사용 가능한 경우 SSL 사용
tr: Varsa SSL kullan
vi: Sử dụng SSL nếu có
zh_hans: 可用时使用 SSL
zh_hant: 可用時使用 SSL

source: Git did not respond in time.
fr: Git n'a pas répondu à temps.

source: Move Up (⌘↑)
fr: Avancer (⌘↑)
ko: 위로 이동 (⌘↑)
tr: Yukarı Taşı (⌘↑)
vi: Di chuyển lên (⌘↑)
zh_hans: 上移 (⌘↑)
zh_hant: 上移 (⌘↑)

source: Not found (404) at %@. Check the Base URL and the model.
fr: Non trouvé (404) à %@. Vérifiez l'URL de base et le modèle.

source: Many Databases, One App
fr: De nombreuses bases de données, une seule application
ko: 하나의 앱, 다양한 데이터베이스
tr: Tek Uygulamada Birçok Veritabanı
vi: Nhiều cơ sở dữ liệu, một ứng dụng
zh_hans: 一个应用，多种数据库
zh_hant: 一個 App，多種資料庫

source: Runs cloudflared against a Cloudflare Access application.
fr: Exécute cloudflared contre une application Cloudflare Access.

source: Data Comparison
fr: Comparaison des données
ko: 데이터 비교
tr: Veri Karşılaştırması
vi: So sánh dữ liệu
zh_hans: 数据比较
zh_hant: 資料比較

source: Unix Timestamp (seconds)
fr: Timestamp Unix (secondes)
ko: Unix 타임스탬프(초)
tr: Unix Zaman Damgası (saniye)
vi: Unix Timestamp (giây)
zh_hans: Unix时间戳（秒）
zh_hant: Unix 時間戳記（秒）

source: Delete Foreign Key
fr: Supprimer la clé étrangère
ko: 외래 키 삭제
tr: Yabancı Anahtarı Sil
vi: Xóa khóa ngoại
zh_hans: 删除外键
zh_hant: 刪除外鍵

source: No AI provider configured. Go to Settings > AI to add one.
fr: Aucun fournisseur d'IA n'est configuré. Allez dans Paramètres > IA pour en ajouter un.
ko: 구성된 AI 제공업체가 없습니다. 설정 > AI로 이동하여 추가하십시오.
tr: Yapılandırılmış AI sağlayıcısı yok. Eklemek için Ayarlar > AI bölümüne gidin.
vi: Chưa cấu hình nhà cung cấp AI. Vào Cài đặt > AI để thêm.
zh_hans: 尚未配置 AI 提供商。前往设置 > AI 添加。
zh_hant: 尚未設定 AI 供應商。請前往「設定 > AI」新增。

source: The database filter hides every database on this connection.
fr: Le filtre de base de données cache toutes les bases de données sur cette connexion.
ko: 데이터베이스 필터로 인해 이 연결의 모든 데이터베이스가 숨겨졌습니다.
tr: Veritabanı filtresi bu bağlantıdaki tüm veritabanlarını gizliyor.
vi: Bộ lọc cơ sở dữ liệu đang ẩn mọi cơ sở dữ liệu trên kết nối này.
zh_hans: 数据库筛选隐藏了此连接上的所有数据库。
zh_hant: 資料庫篩選隱藏了此連線上的所有資料庫。

source: Could not export activity log
fr: Impossible d'exporter le journal d'activité
ko: 활동 로그를 내보낼 수 없습니다
tr: Etkinlik günlüğü dışa aktarılamadı
vi: Không thể xuất nhật ký hoạt động
zh_hans: 无法导出活动日志
zh_hant: 無法匯出活動記錄

source: Export %lld Connections...
fr: Exporter %lld connexions...
ko: 연결 %lld개 내보내기...
tr: %lld Bağlantıyı Dışa Aktar...
vi: Xuất %lld Kết nối...
zh_hans: 导出 %lld 个连接…
zh_hant: 匯出 %lld 個連線…

source: text
fr: texte

source: Label Columns
fr: Colonnes d'étiquetage
ko: 레이블 열
tr: Etiket Sütunları
vi: Cột nhãn
zh_hans: 标签列
zh_hant: 標籤欄位

source: Materialized View
fr: Vue matérialisée
ko: 구체화된 뷰
tr: Materyalize Görünüm
zh_hans: 物化视图
zh_hant: 具體化檢視表

source: Add Role
fr: Ajouter un rôle

source: A script wants to run a query on "%@"
fr: Un script veut exécuter une requête sur "%@"

source: The following %1$lld queries may permanently modify or delete data. This action cannot be undone. %2$@
fr: Les requêtes suivantes %1$lld peuvent modifier ou supprimer définitivement les données. Cette action ne peut pas être annulée. %2$@
ko: 다음 %1$lld개 쿼리는 데이터를 영구적으로 변경하거나 삭제할 수 있습니다. 이 작업은 실행 취소할 수 없습니다. %2$@
tr: The following %lld queries may permanently modify or delete data. This action cannot be undone. %@
vi: %1$lld truy vấn sau có thể thay đổi hoặc xóa dữ liệu vĩnh viễn. Hành động này không thể hoàn tác. %2$@
zh_hans: 以下 %lld 个查询可能会永久修改或删除数据。此操作无法撤销。 %@
zh_hant: 下列 %1$lld 個查詢可能會永久修改或刪除資料。此動作無法復原。 %2$@

source: Import all fields
fr: Importer tous les champs
ko: 모든 필드 가져오기
tr: Tüm alanları içe aktar
vi: Nhập tất cả các trường
zh_hans: 导入所有字段
zh_hant: 匯入所有欄位

source: Default Column
fr: Colonne par défaut
ko: 기본 열
tr: Varsayılan Sütun
vi: Cột mặc định
zh_hans: 默认列
zh_hant: 預設欄位

source: Could Not Reset Sample
fr: Impossible de réinitialiser l'échantillon
ko: 샘플을 초기화할 수 없음
tr: Örnek sıfırlanamadı
vi: Không thể đặt lại Mẫu
zh_hans: 无法重置示例
zh_hant: 無法重設範例

source: The MCP server could not issue its bridge credential
fr: Le serveur MCP n'a pas pu émettre ses informations de connexion de pont.
ko: MCP 서버가 브리지 자격 증명을 발급하지 못했습니다
tr: MCP sunucusu köprü kimlik bilgisini veremedi
vi: Máy chủ MCP không cấp được thông tin xác thực cầu nối
zh_hans: MCP 服务器无法签发其桥接凭据
zh_hant: MCP 伺服器無法簽發其橋接憑證

source: SSH Connection Test Failed
fr: Test de connexion SSH échoué
ko: SSH 연결 테스트 실패
tr: SSH Bağlantı Testi Başarısız
vi: Kiểm tra Kết nối SSH Thất bại
zh_hans: SSH 连接测试失败
zh_hant: SSH 連線測試失敗

source: Page %lld of %lld
fr: Page %lld sur %lld
ko: 페이지 %1$lld / %2$lld
tr: Sayfa %1$lld / %2$lld
vi: Trang %1$lld / %2$lld
zh_hans: 第 %1$lld 页，共 %2$lld 页
zh_hant: 第 %1$lld 頁，共 %2$lld 頁

source: Select Plugin
fr: Sélectionner le plugin
ko: 플러그인 선택
tr: Eklenti Seç
vi: Chọn Plugin
zh_hans: 选择插件
zh_hant: 選擇外掛

source: TablePro connects to the first host over a tunnel. Replica set failover is not available.
fr: TablePro se connecte au premier hôte via un tunnel. Le basculement de réplication n'est pas disponible.

source: Reading connections...
fr: Lecture des connexions...
ko: 연결을 읽는 중...
tr: Bağlantılar okunuyor...
vi: Đang đọc kết nối...
zh_hans: 正在读取连接…
zh_hant: 正在讀取連線…

source: First
fr: Premier

source: %@ must be a whole number.
fr: %@ doit être un nombre entier.

source: Row %lld
fr: Ligne %lld
ko: %lld행
tr: satır %lld
vi: Hàng %lld
zh_hans: 行 %lld
zh_hant: 第 %lld 列

source: Whether the statement names an object, the database, or either
fr: Que la déclaration nomme un objet, la base de données ou l'un des deux

source: Password file not found: %@
fr: Fichier de mot de passe introuvable : %@
ko: 암호 파일을 찾을 수 없음: %@
tr: Parola dosyası bulunamadı: %@
vi: Không tìm thấy tệp mật khẩu: %@
zh_hans: 未找到密码文件：%@
zh_hant: 找不到密碼檔案：%@

source: Execute a query to view results as JSON
fr: Exécutez une requête pour afficher les résultats sous forme JSON.
ko: 쿼리를 실행하고 결과를 JSON으로 표시합니다
tr: Sonuçları JSON olarak görmek için bir sorgu çalıştırın
vi: Chạy truy vấn để xem kết quả dưới dạng JSON
zh_hans: 执行查询以 JSON 形式查看结果
zh_hant: 執行查詢以 JSON 形式檢視結果

source: Delete /%@
fr: Supprimer /%@

source: Filter favorites
fr: Filtrer les favoris
ko: 즐겨찾기 필터링
tr: Filtre sık kullanılanları
vi: Lọc yêu thích
zh_hans: 筛选收藏
zh_hant: 篩選我的最愛

source: Columns the constraint reads, when the engine reports them
fr: Les colonnes indiquent la contrainte lorsque le moteur les signale.

source: Load a saved source, target and options
fr: Charger une source, une cible et des options enregistrées.

source: Could not read the server response. Try again in a moment.
fr: Impossible de lire la réponse du serveur. Réessayez dans un instant.
ko: 서버 응답을 읽을 수 없습니다. 잠시 후 다시 시도하십시오.
tr: Sunucu yanıtı okunamadı. Biraz sonra tekrar deneyin.
vi: Không thể đọc phản hồi từ máy chủ. Vui lòng thử lại sau.
zh_hans: 无法读取服务器响应。请稍后重试。
zh_hant: 無法讀取伺服器回應。請稍後再試一次。

source: %1$@ must be at most %2$lld.
fr: %1$@ doit être au plus %2$lld.

source: Drop Partition
fr: Partition de chute
ko: 파티션 삭제
tr: Bölümü Sil
vi: Xoá phân vùng
zh_hans: 删除分区
zh_hant: 刪除分割區

source: This connection does not support user and role management.
fr: Cette connexion ne prend pas en charge la gestion des utilisateurs et des rôles.
ko: 이 연결은 사용자 및 역할 관리를 지원하지 않습니다.
tr: Bu bağlantı kullanıcı ve rol yönetimini desteklemiyor.
vi: Kết nối này không hỗ trợ quản lý người dùng và vai trò.
zh_hans: 此连接不支持用户和角色管理。
zh_hant: 此連線不支援使用者與角色管理。

source: ^[%lld connection](inflect: true) use this profile. They keep these credentials as their own.
fr: ^[%lld connexion](inflect: true) utilisez ce profil. Ils gardent ces informations de connexion comme s'il s'agissait de leurs propres.

source: Every shared column is generated, so there is nothing to write.
fr: Chaque colonne partagée est générée, donc il n'y a rien à écrire.
ko: 공유하는 모든 열이 생성 열이므로 기록할 내용이 없습니다.
tr: Paylaşılan her sütun üretilmiş sütundur, bu yüzden yazılacak bir şey yok.
vi: Mọi cột chung đều là cột được sinh ra, nên không có gì để ghi.
zh_hans: 所有共有的列都是生成列，因此没有需要写入的内容。
zh_hant: 所有共有的欄位都是產生欄位，因此沒有需要寫入的內容。

source: Ask for password on every connection
fr: Demandez le mot de passe à chaque connexion.
ko: 연결할 때마다 암호 요청
tr: Her bağlantıda şifre sor
vi: Hỏi mật khẩu mỗi lần kết nối
zh_hans: 每次连接时询问密码
zh_hant: 每次連線時詢問密碼

source: Access Token
fr: Token d'accès
ko: 액세스 토큰
tr: Erişim Belirteci
zh_hans: 访问令牌
zh_hant: 存取權杖

source: %1$@ → %2$@ · %3$@ runs before, %4$@ now
fr: %1$@ → %2$@ · %3$@ fonctionne avant, %4$@ maintenant
ko: %1$@ → %2$@ · 이전 실행 %3$@, 현재 %4$@
tr: %1$@ → %2$@ · önce %3$@ çalışma, şimdi %4$@
vi: %1$@ → %2$@ · trước %3$@ lần chạy, hiện %4$@
zh_hans: %1$@ → %2$@ · 之前 %3$@ 次，现在 %4$@ 次
zh_hant: %1$@ → %2$@ · 之前 %3$@ 次，現在 %4$@ 次

source: Default:
fr: Par défaut :
ko: 기본값:
tr: Varsayılan:
vi: Mặc định:
zh_hans: 默认:
zh_hant: 預設：

source: %d databases
fr: %d bases de données

source: This view can't be refreshed concurrently.
fr: Cette vue ne peut pas être mise à jour simultanément.

source: These two engines cannot share a script.
fr: Ces deux moteurs ne peuvent pas partager un script.
ko: 이 두 엔진은 스크립트를 공유할 수 없습니다.
tr: Bu iki motor bir betiği paylaşamaz.
vi: Hai engine này không thể dùng chung một script.
zh_hans: 这两个引擎无法共用一个脚本。
zh_hant: 這兩個引擎無法共用一個指令稿。

source: Cannot generate statements for %@: the driver is not loaded.
fr: Impossible de générer des déclarations pour %@ : le pilote n'est pas chargé.
ko: %@에 대한 명령문을 생성할 수 없습니다: 드라이버가 로드되지 않았습니다.
tr: %@ için ifadeler üretilemiyor: sürücü yüklü değil.
vi: Không thể tạo câu lệnh cho %@: driver chưa được nạp.
zh_hans: 无法为 %@ 生成语句：驱动未加载。
zh_hant: 無法為 %@ 產生陳述式：驅動程式未載入。

source: Maximum days cannot be negative
fr: Le nombre maximum de jours ne peut pas être négatif.
ko: 최대 일수는 음수일 수 없습니다
tr: Maksimum gün negatif olamaz
vi: Số ngày tối đa không được là số âm
zh_hans: 最大天数不能为负数
zh_hant: 最大天數不能為負數

source: Bring All to Front
fr: Apporter tout en avant
ko: 모두 앞으로 가져오기
tr: Tümünü Öne Getir
vi: Đưa tất cả ra phía trước
zh_hans: 全部置于最前
zh_hant: 全部移至最前

source: No comparison yet.
fr: Pas encore de comparaison.
ko: 아직 비교하지 않았습니다.
tr: Henüz karşılaştırma yok.
vi: Chưa có so sánh.
zh_hans: 尚无比较。
zh_hant: 尚無比較。

source: The SOCKS proxy configuration is incomplete. Enter a proxy host and port.
fr: La configuration du proxy SOCKS est incomplète. Veuillez saisir un hôte et un port de proxy.
ko: SOCKS 프록시 구성이 완료되지 않았습니다. 프록시 호스트와 포트를 입력하십시오.
tr: SOCKS proxy yapılandırması eksik. Bir proxy sunucusu ve portu girin.
vi: Cấu hình SOCKS proxy chưa đầy đủ. Hãy nhập máy chủ và cổng proxy.
zh_hans: SOCKS 代理配置不完整。请输入代理主机和端口。
zh_hant: SOCKS 代理設定不完整。請輸入代理主機與連接埠。

source: Clear History
fr: Effacer l'historique
ko: 기록 지우기
tr: Geçmişi Temizle
vi: Xoá lịch sử
zh_hans: 清除历史
zh_hant: 清除記錄

source: Sign in with Cursor
fr: Connectez-vous avec Cursor
ko: Cursor로 로그인
tr: Cursor ile giriş yap
vi: Đăng nhập bằng Cursor
zh_hans: 使用 Cursor 登录
zh_hant: 使用 Cursor 登入

source: history entry
fr: Entrée dans l'histoire
ko: 기록 항목
vi: mục lịch sử
zh_hans: 条历史记录
zh_hant: 筆歷程記錄

source: Export Connections…
fr: Connexions d'exportation...
ko: 연결 내보내기…
tr: Bağlantıları Dışa Aktar…
vi: Xuất Kết nối…
zh_hans: 导出连接…
zh_hant: 匯出連線…

source: Stop trusting %@?
fr: Arrêtez de faire confiance à %@ ?
ko: %@에 대한 신뢰를 해제하시겠습니까?
tr: %@ için güven kaldırılsın mı?
vi: Ngừng tin cậy %@?
zh_hans: 停止信任 %@？
zh_hant: 要停止信任 %@ 嗎？

source: %1$@: only the first %2$lld rows were read, the most this database returns from one query.
fr: %1$@ : seules les premières %2$lld lignes ont été lues, le maximum que cette base de données renvoie d'une requête.

source: Thanks. Your license is what pays for the next release.
fr: Merci. Votre licence est ce qui paie la prochaine version.
ko: 감사합니다. 여러분의 라이선스가 다음 릴리스를 만듭니다.
tr: Teşekkürler. Bir sonraki sürümü sizin lisansınız finanse ediyor.
vi: Cảm ơn bạn. Giấy phép của bạn là thứ chi trả cho bản phát hành tiếp theo.
zh_hans: 谢谢。你的许可证支付了下一个版本的开发。
zh_hant: 謝謝。你的授權支付了下一個版本的開發。

source: Failed to generate SQL for column reorder
fr: Échec de la génération de SQL pour le réordre des colonnes.
ko: 열 순서 변경용 SQL을 생성하지 못했습니다
tr: Sütun yeniden sıralama için SQL oluşturulamadı
vi: Không thể tạo SQL để sắp xếp lại cột
zh_hans: 无法生成列重排序的 SQL
zh_hant: 無法產生欄位重新排序的 SQL

source: cancel stops the query, kill ends the session (default cancel)
fr: Annuler arrête la requête, tuer met fin à la session (annulation par défaut)
ko: cancel은 쿼리를 중지하고 kill은 세션을 종료합니다(기본값 cancel)
tr: cancel sorguyu durdurur, kill oturumu sonlandırır (varsayılan cancel)
vi: cancel dừng truy vấn, kill kết thúc phiên (mặc định cancel)
zh_hans: cancel 停止查询，kill 结束会话（默认 cancel）
zh_hant: cancel 停止查詢，kill 結束工作階段（預設 cancel）

source: Maintenance
fr: Entretien
ko: 유지 관리
tr: Bakım
vi: Bảo trì
zh_hans: 维护
zh_hant: 維護

source: Pane
fr: Vitre

source: Restore Failed
fr: Récupération échouée
ko: 복원 실패
tr: Geri Yükleme Başarısız
vi: Khôi phục thất bại
zh_hans: 恢复失败
zh_hant: 還原失敗

source: A group named “%@” already exists here.
fr: Un groupe nommé "%@" existe déjà ici.
ko: 이 위치에 “%@” 그룹이 이미 있습니다.
tr: Burada “%@” adlı bir grup zaten var.
vi: Đã có nhóm tên “%@” ở đây.
zh_hans: 此处已有名为“%@”的分组。
zh_hant: 此處已有名為「%@」的群組。

source: Settings:
fr: Paramètres :
ko: 설정:
vi: Cài đặt:
zh_hans: 设置：
zh_hant: 設定：

source: Highlight Rules…
fr: Mettre en évidence les règles...

source: Fit to Result
fr: Adapté aux résultats

source: Open Table Tab
fr: Fichier Table ouverte
ko: 테이블 탭 열기
tr: Tablo Sekmesini Aç
vi: Mở tab bảng
zh_hans: 打开表标签页
zh_hant: 開啟資料表分頁

source: New Favorite
fr: Nouveau favori
ko: 새 즐겨찾기
tr: Yeni Sık Kullanılan
vi: Mục yêu thích mới
zh_hans: 新建收藏
zh_hant: 新增我的最愛

source: Storage engine
fr: Moteur de stockage
ko: 스토리지 엔진
tr: Depolama motoru
zh_hans: 存储引擎
zh_hant: 儲存引擎
